DataProcessors/ГрупповоеПерепроведениеДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<DataProcessor>
		<Properties>
			<Name>ГрупповоеПерепроведениеДокументов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОстанавливатьсяПоОшибке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалятьДвиженияДокументовПередПроведением</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ДатаАктуальностиУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ДатаАктуальностиУчета</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОценкаМПЗ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РасчетыСКонтрагентами</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/ГрупповоеПерепроведениеДокументов/Ext/ObjectModule.bsl
Перем мНаборыШаблон;

Перем мКэшОбработки;

// Процедура перепроведения документов
//
// Параметры: 
//  ДатаНач - дата, начиная с которой перепроводятся документы
//  Организация - организация, по которой перепроводятся документы
//  СдвигатьГраницуАктуальности - флаг сдвига назад даты актульности по разделам учета при ошибке проведения документа

Процедура ПерепроведениеДокументов(ДатаНач, ДатаКон = '00010101', Организация = Неопределено, СдвигатьГраницуАктуальности = Ложь) Экспорт
	
	Перем ФормаПрогрессора;
	
	мНаборыШаблон = Новый Структура;
	
	#Если Клиент Тогда
		ФормаПрогрессора = ПолучитьОбщуюФорму("ХодВыполненияОбработкиДанных");
		ФормаПрогрессора.НаименованиеОбработкиДанных = НСтр("ru='Групповое перепроведение документов';uk='Групове перепроведення документів'");
	#КонецЕсли
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Для Каждого ДокументМетаданные ИЗ Метаданные.Документы Цикл
		Если ДокументМетаданные =  Метаданные.Документы.УпрВнутреннееПеремещениеНаличныхДенежныхСредств
			ИЛИ ДокументМетаданные =  Метаданные.Документы.УпрОбменВалют
			ИЛИ ДокументМетаданные =  Метаданные.Документы.УпрПриходныйКассовыйОрдер
			Или ДокументМетаданные =  Метаданные.Документы.УпрРасходныйКассовыйОрдер Тогда
			Продолжить;
		КонецЕсли;
		
		Запрос.Текст = Запрос.Текст + ?(Запрос.Текст = "", "ВЫБРАТЬ РАЗРЕШЕННЫЕ ", "
		|ОБЪЕДИНИТЬ ВСЕ
		|    ВЫБРАТЬ 
		|    ") + """" + ДокументМетаданные.Имя + """ КАК ИмяДокумента, Представление КАК Представление, Ссылка КАК Ссылка, Дата КАК Дата ИЗ Документ." + ДокументМетаданные.Имя + "
		|ГДЕ Проведен И Дата >= &ДатаНач";
		
		Если ДатаКон <> Дата('00010101') Тогда
			Запрос.Текст = Запрос.Текст + " И Дата <= &ДатаКон";
		КонецЕсли;
		
		Если Организация <> Неопределено И ДокументМетаданные.Реквизиты.Найти("Организация") <> Неопределено Тогда
			Если ТипЗнч(Организация) = Тип("Массив") Тогда
				Запрос.Текст = Запрос.Текст + " И Организация В (&Организация)";
			Иначе
				Запрос.Текст = Запрос.Текст + " И Организация = &Организация";
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Запрос.Текст = Запрос.Текст + "
	|УПОРЯДОЧИТЬ ПО Дата, Ссылка";
	
	Запрос.УстановитьПараметр("ДатаНач", ДатаНач);
	Запрос.УстановитьПараметр("ДатаКон", КонецДня(ДатаКон));
	
	ТаблицаДокументов = Запрос.Выполнить().Выгрузить();
	ТаблицаДокументов.Колонки.Добавить("БылаОшибка", Новый ОписаниеТипов("Булево"));
	ВсегоДокументов = ТаблицаДокументов.Количество();
	
	
	Если УдалятьДвиженияДокументовПередПроведением Тогда
		Если ФормаПрогрессора <> Неопределено Тогда
			ФормаПрогрессора.Значение = 0;
			ФормаПрогрессора.МаксимальноеЗначение = ВсегоДокументов;		
			ФормаПрогрессора.КомментарийОбработкиДанных  = НСтр("ru='Удаление движений проведенных документов';uk='Вилучення рухів проведених документів'");		
			ФормаПрогрессора.Открыть();
		КонецЕсли;	
		
		Для Каждого СтрокаДокумента ИЗ ТаблицаДокументов Цикл
			
			Если ФормаПрогрессора <> Неопределено Тогда
				ФормаПрогрессора.КомментарийЗначения = СтрокаДокумента.Представление;
				ФормаПрогрессора.Значение = ФормаПрогрессора.Значение + 1;
			КонецЕсли;
			
			Регистратор = СтрокаДокумента.Ссылка;
			КоллекцияДвижений = Метаданные.Документы[СтрокаДокумента.ИмяДокумента].Движения;
			НачатьТранзакцию();
			Для Каждого НаборМетаданные ИЗ КоллекцияДвижений Цикл
				Набор = ПолучитьНаборЗаписей(НаборМетаданные);
				Набор.Отбор.Регистратор.Установить(Регистратор);
				Набор.Записать();
				Запрос.УстановитьПараметр(СтрокаДокумента.ИмяДокумента + "Ссылка", Регистратор);
				Запрос.УстановитьПараметр(СтрокаДокумента.ИмяДокумента + "Дата", СтрокаДокумента.Дата);
			КонецЦикла;
			ЗафиксироватьТранзакцию();
			
		КонецЦикла;	
	КонецЕсли;
	
	Если ФормаПрогрессора <> Неопределено Тогда
		ФормаПрогрессора.Значение = 0;
		ФормаПрогрессора.МаксимальноеЗначение = ВсегоДокументов;
		ФормаПрогрессора.КомментарийОбработкиДанных  = НСтр("ru='Проведение документов';uk='Проведення документів'");		
		ФормаПрогрессора.Открыть();
	КонецЕсли;	
	
	
	
	ИндексСтрокиНачалаДаты = Неопределено;
	ТекущаяДатаПроведения = Неопределено;
	
	Для индекс = 0 ПО ВсегоДокументов - 1 Цикл
		СтрокаДокумента = ТаблицаДокументов[индекс];
		Если ФормаПрогрессора <> Неопределено Тогда
			ФормаПрогрессора.КомментарийЗначения = СтрокаДокумента.Представление;
			ФормаПрогрессора.Значение = ФормаПрогрессора.Значение + 1;
		КонецЕсли;
		
		ДокументОбъект = СтрокаДокумента.Ссылка.ПолучитьОбъект();
		Если ТекущаяДатаПроведения <> ДокументОбъект.Дата Тогда
			ИндексСтрокиНачалаДаты = индекс;
			ТекущаяДатаПроведения = ДокументОбъект.Дата;
		КонецЕсли;
		
		Попытка
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
		Исключение
			Если СдвигатьГраницуАктуальности Тогда
				
				Если СтрокаДокумента.БылаОшибка Тогда
					// для документа уже была ошибка проведения, продолжение не возможно
					ОбщегоНазначения.СообщитьОбОшибке(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Документ %1 не проведен!"
"По причине: %2';uk='Документ %1 не проведений!"
"Через: %2'"), Строка(ДокументОбъект), ОписаниеОшибки()), , НСтр("ru='Ошибка проведения!';uk='Помилка проведення!'"));
					Если ОстанавливатьсяПоОшибке Тогда
						Прервать;
					КонецЕсли;
				КонецЕсли;
				
				СдвигГраницыАктуалностиПоРазделам(СтрокаДокумента.ИмяДокумента, ДокументОбъект);
				СтрокаДокумента.БылаОшибка = Истина;
				индекс = ИндексСтрокиНачалаДаты;
				
			Иначе
				
				ОбщегоНазначения.СообщитьОбОшибке(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Документ %1 не проведен!"
"По причине: %2';uk='Документ %1 не проведений!"
"Через: %2'"), Строка(ДокументОбъект), ОписаниеОшибки()), , НСтр("ru='Ошибка проведения!';uk='Помилка проведення!'"));
				Если ОстанавливатьсяПоОшибке Тогда
					Прервать;
				КонецЕсли;				
				
			КонецЕсли;
		КонецПопытки;
		
	КонецЦикла;
	
	Если ФормаПрогрессора <> Неопределено Тогда
		ФормаПрогрессора.Закрыть();
	КонецЕсли;
	
КонецПроцедуры

Процедура СдвигГраницыАктуалностиПоРазделам(ИмяДокумента, ДокументОбъект)
	
	МетаданныеОбъекта = мКэшОбработки.МетаданныеОбъектов[ИмяДокумента];
	Если МетаданныеОбъекта = Неопределено Тогда
		МетаданныеОбъекта = ДокументОбъект.Метаданные();
		мКэшОбработки.МетаданныеОбъектов[ИмяДокумента] = МетаданныеОбъекта;
	КонецЕсли;
	
	Если МетаданныеОбъекта.Реквизиты.Найти("Организация") = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДатыПоРазделам = мКэшОбработки.АктуальностьРазделовПоОрганизации[ДокументОбъект.Организация];
	Если ДатыПоРазделам = Неопределено Тогда
		ДатыПоРазделам = РегистрыСведений.ДатаАктуальностиУчета.Получить(Новый Структура("Организация", ДокументОбъект.Организация));
		мКэшОбработки.АктуальностьРазделовПоОрганизации[ДокументОбъект.Организация] = ДатыПоРазделам;		
	КонецЕсли;
	
	НужнаЗапись = Ложь;
	Для Каждого КлючИЗначение ИЗ ДатыПоРазделам Цикл
		Если КлючИЗначение.Значение > НачалоДня(НачалоДня(ДокументОбъект.Дата) - 1) Тогда
			ДатыПоРазделам[КлючИЗначение.Ключ] = НачалоДня(НачалоДня(ДокументОбъект.Дата) - 1);
			НужнаЗапись = Истина;
		КонецЕсли;		
	КонецЦикла;	
	
	Если НужнаЗапись Тогда
		Запись = РегистрыСведений.ДатаАктуальностиУчета.СоздатьМенеджерЗаписи();
		Запись.Организация = ДокументОбъект.Организация;
		Для Каждого КлючИЗначение ИЗ ДатыПоРазделам Цикл
			Запись[КлючИЗначение.Ключ] = КлючИЗначение.Значение;
		КонецЦикла;
		Запись.Записать();
	КонецЕсли;
			
КонецПроцедуры

Функция ПолучитьНаборЗаписей(НаборМетаданные)
	
	Если мНаборыШаблон.Свойство(НаборМетаданные.Имя) Тогда
		Возврат мНаборыШаблон[НаборМетаданные.Имя];
		
	Иначе
		Если Метаданные.РегистрыСведений.Содержит(НаборМетаданные) Тогда
			Набор = РегистрыСведений[НаборМетаданные.Имя].СоздатьНаборЗаписей();
			
		ИначеЕсли Метаданные.РегистрыНакопления.Содержит(НаборМетаданные) Тогда
			Набор = РегистрыНакопления[НаборМетаданные.Имя].СоздатьНаборЗаписей();
			
		ИначеЕсли Метаданные.РегистрыБухгалтерии.Содержит(НаборМетаданные) Тогда
			Набор = РегистрыБухгалтерии[НаборМетаданные.Имя].СоздатьНаборЗаписей();
			
		ИначеЕсли Метаданные.РегистрыРасчета.Содержит(НаборМетаданные) Тогда
			Набор = РегистрыРасчета[НаборМетаданные.Имя].СоздатьНаборЗаписей();
			
		КонецЕсли;	
		
		мНаборыШаблон.Вставить(НаборМетаданные.Имя, Набор);
		Возврат Набор;
		
	КонецЕсли;
	
КонецФункции

мКэшОбработки = Новый Структура;
мКэшОбработки.Вставить("МетаданныеОбъектов", Новый Соответствие);
мКэшОбработки.Вставить("АктуальностьРазделовПоОрганизации", Новый Соответствие);
